>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. day01.
DATA DIVISION.

WORKING-STORAGE SECTION.
    01 WS-LINE	PIC X(100).
    01 WS-NUMBER PIC S9(9) COMP.
    01 WS-TOTAL	PIC S9(9) COMP VALUE 0.
    01 WS-DISPLAY-TOTAL PIC -9(9).

PROCEDURE DIVISION.
    PERFORM FOREVER
        ACCEPT WS-LINE
            ON EXCEPTION
                EXIT PERFORM
    END-ACCEPT

    IF WS-LINE NOT = SPACES
	COMPUTE WS-NUMBER = FUNCTION NUMVAL(WS-LINE)
	ADD WS-NUMBER TO WS-TOTAL
    END-IF
    
    END-PERFORM
    MOVE WS-TOTAL TO WS-DISPLAY-TOTAL
    DISPLAY WS-DISPLAY-TOTAL
    STOP RUN.
